tap "ankitpokhrel/jira-cli"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "apache-arrow"
brew "automake"
brew "aws-iam-authenticator"
brew "readline"
brew "awscli"
brew "awslogs"
brew "bat"
brew "boost"
brew "glib"
brew "cairo"
brew "gmp"
brew "coreutils"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cgal"
brew "fd"
brew "fzf"
brew "geos"
brew "libksba"
brew "shared-mime-info"
brew "libheif"
brew "openssl@1.1"
brew "python@3.9"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gh"
brew "git-flow"
brew "gts"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "jq"
brew "lazygit"
brew "libdap"
brew "libyaml"
brew "neovim"
brew "nghttp2"
brew "node"
brew "qt@5"
brew "poppler-qt5"
brew "postgresql@14"
brew "sfcgal"
brew "postgis"
brew "pyenv"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "chromium"
cask "docker"
cask "font-symbols-only-nerd-font"
cask "pgadmin4"
cask "slack"
cask "tower"
cask "visual-studio-code"
vscode "azemoh.one-monokai"
vscode "bajdzis.vscode-database"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "CraigMaslowski.erb"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-codeql"
vscode "GitHub.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "hjleochen.rails-nav"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.vscode-peacock"
vscode "KoichiSasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "PKief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "sianglim.slim"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "thenikso.github-plus-theme"
vscode "usernamehw.errorlens"
vscode "vector-of-bool.gitflow"
vscode "wesbos.theme-cobalt2"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
