tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "boost"
brew "cairo"
brew "coreutils"
brew "ctags"
brew "freetds"
brew "freetype"
brew "gdk-pixbuf"
brew "glib"
brew "gobject-introspection"
brew "graphviz"
brew "gts"
brew "harfbuzz"
brew "imagemagick@6", link: true
brew "lazygit"
brew "libevent"
brew "libksba"
brew "librsvg"
brew "libtool"
brew "libyaml"
brew "mysql"
brew "neovim"
brew "nmap"
brew "openssl@1.1"
brew "pango"
brew "pkg-config"
brew "python@3.8", link: false
brew "python@3.9"
brew "readline", link: true
brew "redis"
brew "tmux"
brew "vim"
brew "yarn"
brew "zlib"
cask "chromedriver"
cask "wezterm"
vscode "azemoh.one-monokai"
vscode "bajdzis.vscode-database"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "GitHub.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "johnpapa.vscode-peacock"
vscode "jtjoo.classic-asp-html"
vscode "karigari.chat"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "PKief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "thenikso.github-plus-theme"
vscode "vector-of-bool.gitflow"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
